package com.example.recipebox

import com.example.recipebox.database.Recipes

object RecipesRepository {
    val recipes = arrayListOf(
        Recipes(0,
            "Брауни",
            "Один из самых популярных десертов в мире — брауни — был придуман в 1893 году на кухне легендарного отеля Palmer House в Чикаго. Этот пирог там пекут до сих пор по оригинальному рецепту, покрывая сверху абрикосовой глазурью. В домашней версии, впрочем, у брауни получается такая изумительная сахарная корочка, что глазировать ее было бы преступлением. У традиционных шоколадных брауни ванильный аромат, хрустящая корочка и влажная серединка. В торт также добавляют грецкие орехи или фисташки, а еще клюкву.",
            "Темный шоколад\n" +
                    "100 г\n" +
                    "Сливочное масло\n" +
                    "180 г\n" +
                    "Коричневый сахар\n" +
                    "200 г\n" +
                    "Куриное яйцо\n" +
                    "4 штуки\n" +
                    "Пшеничная мука\n" +
                    "100 г\n" +
                    "Грецкие орехи\n",
            "https://avatars.mds.yandex.net/get-zen_doc/118284/pub_5d47b48eec575b00ad9a2522_5d47b4ac6c300400ad53a5bf/scale_1200",
        )
    )
}